investigation/ias/xml/xml11.res

<?xml version="1.1"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><addEditBOTask xmlns="http://untill.eu/wm/soap/wmapi/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><scheme i:type="PlainAuthScheme"><login>admin</login><password>+</password></scheme><arg0><description>Edited User &lt;em class="bo-prod-name"&gt;3&lt;/em&gt;&#xD;
Direct Sales Table set to 0&#xD;
</description><startTime>1518079885576</startTime><status>NOT_STARTED</status><editBOSubTasks><value><locationGuid>Lviv 1</locationGuid><status>NOT_STARTED</status><startTime>1518079885576</startTime><idRecord>5103346</idRecord><tableName>UNTILL_USERS</tableName><fieldValues><value><key>NAME</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema">3</value></value><value><key>IS_ACTIVE</key><value i:type="a:short" xmlns:a="http://www.w3.org/2001/XMLSchema">1</value></value><value><key>ADDRESS</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>USER_VOID</key><value i:type="a:int" xmlns:a="http://www.w3.org/2001/XMLSchema">0</value></value><value><key>FIRSTNAME</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>IS_ACTIVE</key><value i:type="a:short" xmlns:a="http://www.w3.org/2001/XMLSchema">1</value></value><value><key>LANGUAGE</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema">0813</value></value><value><key>ID_GROUP_USERS</key><value i:type="a:int" xmlns:a="http://www.w3.org/2001/XMLSchema">5095560</value></value><value><key>USER_CLOCK_IN</key><value i:type="a:int" xmlns:a="http://www.w3.org/2001/XMLSchema">0</value></value><value><key>LASTNAME</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>USER_POSCODE</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema">9574</value></value><value><key>USER_CODE</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>IS_CUSTOM_REMOTETERM_POSCODE</key><value i:type="a:int" xmlns:a="http://www.w3.org/2001/XMLSchema">0</value></value><value><key>USER_POSCODE_REMOTETERM</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>TP_API_PWD</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>PHONE</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>START_WEEK_DAY</key><value i:type="a:int" xmlns:a="http://www.w3.org/2001/XMLSchema">0</value></value><value><key>USER_TRANSFER</key><value i:type="a:int" xmlns:a="http://www.w3.org/2001/XMLSchema">1</value></value><value><key>INSURANCE</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>TERMINAL_ID</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema">1</value></value><value><key>USER_CARD</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema">&#x2;010CC4E793</value></value><value><key>EMAIL</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"/></value><value><key>DATEBIRTH</key></value><value><key>START_WEEK_TIME</key><value i:type="a:dateTime" xmlns:a="http://www.w3.org/2001/XMLSchema">1970-01-01T08:00:00</value></value><value><key>MANDATES</key><value i:type="a:base64Binary" xmlns:a="http://www.w3.org/2001/XMLSchema">ezQyOThFMEZGLUJBNjYtNEU2Ny1CQkY3LTMwRkQ4QzAwNzFEN30NCntBQjlCRTMyRi04NzAyLTQwNkYtOEQxQi0wQUY1MTZDODA1Nzd9DQo=</value></value><value><key>HQ_ID</key><value i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema">3</value></value></fieldValues><operation>UPDATE</operation><key><value>0</value></key><tryCancel>false</tryCancel><insertedId i:nil="true"/><attemptNumber>0</attemptNumber></value><value><locationGuid>Lviv 1</locationGuid><status>NOT_STARTED</status><startTime>1518079885576</startTime><idRecord>5116859</idRecord><tableName>WAITERS</tableName><fieldValues><value><key>DIRECT_SALES_TABLE</key><value i:type="a:int" xmlns:a="http://www.w3.org/2001/XMLSchema">0</value></value></fieldValues><operation>UPDATE</operation><tryCancel>false</tryCancel><insertedId i:nil="true"/><attemptNumber>0</attemptNumber></value></editBOSubTasks><type>EDIT_BO</type></arg0></addEditBOTask></s:Body></s:Envelope>